Repository: pypi-data/pypi-mirror-24
Catalog: packages/diacamma-financial/diacamma_financial-2.1.13.17083018-py2.py3-none-any.whl/diacamma/payoff/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Diacamma payoff
fr: Règlement Diacamma

source: payoff null!
fr: réglement vide!

source: No-valid selection!
fr: Sélection non valide!

source: by ratio
fr: par prorata

source: by date
fr: par date

source: repartition mode
fr: mode de répartition

source: third
fr: tiers

source: is revenu
fr: est un revenu

source: total payed
fr: total payé

source: rest to pay
fr: rest dû

source: supporting
fr: support

source: no third selected
fr: aucun tiers sélectionné

source: third has not correct account
fr: le tiers n'a pas de compte correcte

source: date not include in current fiscal year
fr: la date n'est pas incluse dans l'exercice

source: designation
fr: désignation

source: reference
fr: référence

source: account code
fr: code comptable

source: bank account
fr: compte bancaire

source: bank accounts
fr: comptes bancaire

source: amount
fr: montant

source: cash
fr: espèce

source: cheque
fr: chèque

source: transfer
fr: virement

source: crédit card
fr: carte de crédit

source: other
fr: autre

source: levy
fr: prélèvement

source: payer
fr: payeur

source: entry
fr: écriture

source: bank fee
fr: frais bancaire

source: value
fr: valeur

source: an entry associated to this payoff is closed!
fr: une écriture associée à ce réglement est clôturée!

source: payoff for %s
fr: réglement de %s

source: account is not defined!
fr: le compte n'est pas défini!

source: payoff for %d multi-pay
fr: réglement de %d factures

source: payoff
fr: réglement

source: payoffs
fr: réglements

source: building
fr: en cours

source: closed
fr: clôturé

source: valid
fr: validé

source: number
fr: nombre

source: Remove of %s impossible!
fr: Supression de %s impossible!

source: To Close
fr: Clôturer

source: Validate
fr: Valider

source: deposit slip
fr: dépôt de chèques

source: deposit slips
fr: dépôts de chèques

source: deposit
fr: dépôt

source: deposit detail
fr: détail

source: deposit details
fr: détails

source: parameters
fr: paramètres

source: payable to
fr: libellé à

source: address
fr: adresse

source: Paypal account
fr: compte Paypal

source: payment method
fr: moyen de paiement

source: payment methods
fr: moyens de paiement

source: failure
fr: échec

source: success
fr: succès

source: contains
fr: contenu

source: bank transaction
fr: transaction bancaire

source: bank transactions
fr: transactions bancaires

source: payoff-bankcharges-account
fr: compte de frais bancaire

source: payoff-cash-account
fr: compte de caisse

source: payoff-email-message
fr: message de courriel par défaut

source: %(name)s Joint in this email %(doc)s. Regards
fr: %(name)s Veuillez trouver ci-Joint à ce courriel %(doc)s. Sincères salutations

source: Add payoff
fr: Ajouter un réglement

source: Modify payoff
fr: Modifier un réglement

source: Delete payoff
fr: Supprimer un réglement

source: change
fr: changer

source: Select third
fr: Sélection d'un tiers

source: Filtrer by contact
fr: Filtre par contact

source: select
fr: sélectionner

source: Send
fr: Envoyer

source: Send by email
fr: Envoyer par courriel

source: subject
fr: sujet

source: add payment methods in email
fr: Ajouter les moyens de paiement dans le courriel

source: Payment
fr: Paiement

source: No payment for this document.
fr: Pas de paiement pour ce document

source: Payement methods
fr: Moyens de paiement

source: Management of parameters and configuration of payoff
fr: Gestion des paramètres et des configuration du règlement

source: Payoff configuration
fr: Configuration du règlement

source: Bank account
fr: Compte bancaire

source: Payment method
fr: Moyen de paiement

source: Parameters
fr: Paramètres

source: Add bank account
fr: Ajouter un compte bancaire

source: Modify bank account
fr: Modifier un compte bancaire

source: Delete bank account
fr: Supprimer un compte bancaire

source: Add payment method
fr: Ajouter un moyen de paiement

source: Modify payment method
fr: Modifier un moyen de paiement

source: Delete payment method
fr: Supprimer un moyen de paiement

source: Payoff
fr: Réglement

source: Configuration of payoff parameters
fr: Definissez vos paramètrages de règlement

source: Configuration of bank account
fr: Ajoutez vos comptes bancaires.{[br/]}Ils apparaitrons comme choix de réglement.

source: Configuration of payment method
fr: Ajoutez vos moyens de paiements.{[br/]}Ces choix seront proposés à vos utilisateurs pour un réglement à distance.

source: manage deposit of cheque
fr: gestion des dépôts de chèques

source: Filter by status
fr: Filtre par status

source: Filter by year
fr: Filtre par exercice

source: Add deposit slip
fr: Ajouter un dépôt de chèques

source: Modify deposit slip
fr: Modifier un dépôt de chèques

source: Show deposit slip
fr: Voir un dépôt de chèques

source: Delete deposit slip
fr: Supprimer un dépôt de chèques

source: Print deposit slip
fr: Imprimer un dépôt de chèques

source: Add deposit detail
fr: Ajouter un détail

source: select cheque to deposit
fr: sélectionnez les chèques à déposer

source: payer contains
fr: payeur contient

source: reference contains
fr: référence contient

source: bill
fr: facture

source: Save deposit detail
fr: Sauver le détail

source: Delete deposit detail
fr: Supprimer un détail

source: show bank transactions
fr: voir les transactions bancaires

source: Bank transactions
fr: Transactions bancaires

source: Show bank transaction
fr: Voir une transaction bancaire
