Repository: pypi-data/pypi-mirror-24
Catalog: packages/Products.JWPlayer/Products.JWPlayer-1.1.tar.gz/Products.JWPlayer-1.1/src/Products/JWPlayer/locales/*/LC_MESSAGES/Products.JWPlayer.po
Languages: de

source: Close
de: Schließen

source: Enter URL to video
de: Fügen Sie die URL des Videos ein

source: Example
de: Beispiel

source: Insert
de: Einfügen

source: Installs the Products.JWPlayer add-on.
de: Installiert die Products.JWPlayer Erweiterung

source: JW Player (Cloud) Library URL
de: URL der JW Player (Cloud) Bibliothek

source: JW Player (Self-Hosted) Key
de: Schlüssel des JWPlayer (selbst gehostet)

source: JW Player (Self-Hosted) Library URL
de: URL der JW Player (selbst gehostet) Bibliothek

source: JWPlayer Settings
de: JWPlayer Einstellungen

source: Player Options (one per line)
de: Player Optionen (eine pro Zeile)

source: Preview
de: Vorschau

source: Products.JWPlayer (uninstall)
de: Products.JWPlayer (deinstallieren)

source: Uninstalls the Products.JWPlayer add-on.
de: Deinstalliert die Products.JWPlayer Erweiterung

source: Use cloud player
de: Benutzen Sie den Cloud-Player

source: Use self-hosted player
de: Benutzen Sie den selbst gehosteten Player
