Repository: pypi-data/pypi-mirror-24
Catalog: packages/teamSpeakTelegram/teamSpeakTelegram-0.8.0.tar.gz/teamSpeakTelegram-0.8.0/teamSpeakTelegram/locale/*/LC_MESSAGES/teamspeak.po
Languages: es

source: Update
es: Actualizar

source: You aren't allow to use this
es: No se te permite usar esto

source: Users online:
es: Conectados:

source: There is no one right now
es: No hay nadie ahora mismo

source: Activated mentions
es: Menciones activadas

source: Disabled mentions
es: Menciones desactivadas

source: User banned successfully
es: Usuario baneado correctamente

source: User unbanned successfully
es: Usuario desbaneado correctamente

source: User kicked successfully
es: Usuario kickeado correctamente

source: Something went wrong
es: Algo fue mal

source: User added successfully
es: Usuario añadido correctamente

source: User deleted from group successfully
es: Usuario eliminado del grupo correctamente

source: Page
es: Pág.

source: Prev
es: Ant

source: Next
es: Sig

source: No results
es: Sin resultados

source: Ok, give me an *alias* for that user
es: Ok, dame un *alias* para ese usuario

source: Skip
es: Saltar

source: Ok, is this user on Telegram?
es: Ok, ¿está este usuario en Telegram?

source: Alias assigned successfully
es: Alias asignado correctamente

source: *Group list:*
es: *Listado de grupos:*

source: Here is a list of your TeamSpeak groups, pressing any of them will take you to his detail.
es: Aquí se muestra un listado de sus grupos de TeamSpeak, presione cualquiera para llevarle a sus detalles.

source: Here is the TeamSpeak group list of this user, pressing any of them will take you to his detail.
es: Aquí se muestra un listado de los grupos de TeamSpeak de este usuario, presione cualquiera para llevarle a sus detalles.

source: Back
es: Atrás

source: Access to default group is forbidden
es: Acceso a grupos por defecto restringido

source: group:
es: grupo:

source: List users
es: Listar usuarios

source: Add user
es: Añadir usuario

source: Delete user
es: Eliminar usuario

source: *Group users:*
es: *Usuarios del grupo:*

source: Here is a list of all users in this group, pressing any of them will take you to his detail.
es: Aquí se muestra un listado de todos los usuarios en este grupo, presione cualquiera para llevarle a sus detalles.

source: *Select an user to add to the group:*
es: *Seleccione un usuario para añadir al grupo:*

source: *Select an user to delete from group:*
es: *Seleccione un usuario para eliminar del grupo:*

source: *User list:*
es: *Listado de usuarios:*

source: Here is a list of all your TeamSpeak users, pressing any of them will take you to his detail.
es: Aquí se muestra un listado de todos sus usuarios de TeamSpeak, presione cualquiera para llevarle a sus detalles.

source: ID banned
es: ID banneado

source: ID unbanned
es: ID desbaneado

source: IP banned
es: IP banneado

source: IP unbanned
es: IP desbaneado

source: Name banned
es: Nombre banneado

source: Name unbanned
es: Nombre desbanneado

source: Channel kick
es: Expulsar del canal

source: Server kick
es: Expulsar del servidor

source: Assign alias
es: Asignar alias

source: Groups
es: Grupos

source: ONLINE
es: CONECTADO

source: since
es: desde

source: *Name:*
es: *Nombre:*

source: *User details:*
es: *Detalles:*

source: *Last connection:*
es: *Últ. conexión*

source: *Last IP:*
es: *Última IP:*

source: *Client DB identifier:*
es: *Identificador de BD:*

source: *Client Unique identifier:*
es: *ID de usuario:*

source: *Date creation:*
es: *Fecha de creación:*

source: *Total connections:*
es: *Conexiones totales:*

source: No changes
es: Sin cambios

source: Successfully updated
es: Actualizado correctamente

source: You must be admin
es: Debes ser administrador

source: Ok, what message do you want to send? Use /cancel to cancel the command.
es: De acuerdo, ¿que mensaje desea enviar? Usa /cancel para cancelar el comando actual.

source: Global message has been sent to server successfully.
es: El mensaje global ha sido enviado al servidor con éxito.

source: Connect TS
es: Conectar TS

source: Welcome %s you're now activated, using /who or /ts you can check who's in teamspeak.
es: Bienvenido %s ya estás activado, usando /who o /ts puedes comprobar quién hay en teamSpeak.

source: Hello %s, using /who or /ts you can check who's in teamspeak.
es: Hola %s, usando /who o /ts puedes comprobar quién hay en teamspeak.

source: Welcome, ask admin to generate an invitation link by /generate
es: Bienvenido, pide al administrador que genere un enlace de invitación mediante /generate

source: Join
es: Unirse

source: Share link
es: Compartir enlace

source: Welcome to TeamSpeak bot
es: Bienvenido al bot de TeamSpeak

source: This is an invitation to use the TeamSpeak bot
es: Esta es una invitación para usar el bot de TeamSpeak

source: Use this command in the group where you want to activate/disable the notifications
es: Usa este comando en el grupo donde desees activar/desactivar las notificaciones

source: Global text has been cancelled.
es: El mensaje global ha sido cancelado.

source: Sorry, I didn't understand that command.
es: Lo siento, no entiendo ese comando.
