Repository: pypi-data/pypi-mirror-24
Catalog: packages/cmsplugin_contact_plus/cmsplugin_contact_plus-1.3.12.tar.gz/cmsplugin_contact_plus-1.3.12/cmsplugin_contact_plus/locale/*/LC_MESSAGES/django.po
Languages: es, fr

source: Contact Form
es: Formulario de contacto
fr: Formulaire de contact

source: No referral available.
es: Remisión no disponible

source: Key/value parameter not available.
es: Parametro para clave/valor no disponible
fr: Paramètre clé/valeur non disponible.

source: Contact form message from {}
es: Mensaje de formulario para {}
fr: Message via le formulaire de contact de {}

source: Title
es: Título
fr: Titre

source: Title for the Contact Form.
es: Título para el formulario de contacto
fr: Titre du formulaire de contact

source: Email subject
es: Asunto del correo electrónico
fr: Sujet email

source: Email of recipients
es: Correo de los destinatarios
fr: Addresses email des destinataires

source: Collect Records
es: Recolección de registros
fr: Enregistrer les envois

source: If active, all records for this Form will be stored in the Database.
es: Si está activo, todos los registros de este formulario serán guardados en la base de datos
fr: Si configuré, toutes les entrées du formulaire seront sauvegardée dans la base de données.

source: Message displayed after submitting the contact form.
es: Mensaje mostrado despúes de enviar el formulario
fr: Message affiché après la validation du formulaire de contact.

source: Text for the Submit button.
es: Texto para el botón de enviar
fr: Texte du bouton « soumettre ».

source: Contact Plus Form for %s
es: Contact Plus Form para %s
fr: Contact Plus Form pour %s

source: CharField as Textarea
es: Campo de caracteres como un área de texto
fr: CharField comme Textarea

source: CharField as HiddenInput
es: Campo de caracteres oculto
fr: CharField comme Textarea

source: Referral page as HiddenInput
es: Página de remisión oculta
fr: Page référente comme HiddenInput

source: GET parameter as HiddenInput
es: Parámetros GET ocultos
fr: Paramètres GET comme HiddenInput

source: Label
es: Etiqueta
fr: Etiquette

source: Inital Value
es: Valor inicial
fr: Valeur initiale

source: Mandatory field
es: Campo Obligatorio
fr: Champs obligatoires

source: Will be ignored in the current version.
es: Será ignorado en la versión actual
fr: Ignoré dans la version actuelle

source: Date the Record was processed.
es: Fecha de registro fue procesada
fr: Date de la saisie du formulaire.

source: Contact Record
es: Registro de contacto
fr: Demande de contact

source: Contact Records
es: Registros de contacto
fr: Demandes de contact

source: Record for %(contact)s recorded on %(date)s
es: Registro para %(contact)s registrados el %(date)s
fr: Demande pour %(contact)s saisie le %(date)s
