Repository: pypi-data/pypi-mirror-24
Catalog: packages/subconvert/subconvert-3.0.0a4.tar.gz/subconvert-3.0.0a4/src/subconvert/locale/*/LC_MESSAGES/subconvert.po
Languages: pl

source: No such file: '%s'
pl: Plik nie istnieje: '%s'

source: Subconvert is a movie subtitles editor and converter.
pl: Subconvert jest edytorem i konwerterem napisów filmowych.

source: FILE
pl: PLIK

source: files to open
pl: pliki do otwarcia

source: runs Subconvert in console
pl: uruchamia Subconverta w konsoli

source: forces all operations without asking (assuming yes)
pl: wymusza wszystkie operacje bez pytania (zakładając zgodę)

source: subtitle options
pl: opcje dla napisów

source: output file. All occurences of '%%f', will be replaced by input file name base
pl: plik wyjściowy. Wszystkie wystąpienia '%%f' zostaną zastąpione nazwą pliku bez rozszerzenia

source: input file encoding
pl: kodowanie wejściowe pliku

source: changes output file encoding to ENC
pl: zmienia kodowanie wyjściowe pliku na ENC

source: sets output subtitle format to FMT
pl: ustawia format wyjściowy pliku na FMT

source: loads settings from spf (subtitle property file)
pl: wczytuje ustawienia z pliku spf

source: SPEC
pl: FMT

source: synchronize subtitles according to SPEC
pl: synchronizuj napisy według formatu FMT

source: video options
pl: opcje wideo

source: specifies video frames per second
pl: określa ilość klatek na sekundę dla pliku wideo

source: VIDEO
pl: WIDEO

source: specifies a video file to get FPS value from. All occurences of '%%f' will be replaced by input file name base
pl: określa plik filmowy, z którego zostanie pobrana wartość FPS. Wszystkie wystąpienia '%%f' zostaną zastąpione nazwą pliku bez rozszerzenia

source: miscellaneous options
pl: pozostałe usttawienia

source: enables debug prints
pl: włącza logi debugowe

source: silences Subconvert output
pl: ucisza wyjście Subconverta

source: prints program version and exit
pl: wyświetla numer wersji programu i kończy działanie

source: Couldn't parse file '%s'
pl: Nie udało się sparsować pliku '%s'

source: Unknown output format: '%s'
pl: Nieznany format wyjściowy: '%s'

source: File %s saved.
pl: Plik %s zapisany.

source: y
pl: t

source: q
pl: z

source: File '%(file)s' exists. Overwrite? [%(yes)s/%(no)s/%(bck)s/%(quit)s]
pl: Plik '%(file)s' już istnieje. Nadpisać? [%(yes)s/%(no)s/%(bck)s/%(quit)s]

source: Overwriting %s
pl: Nadpisywanie %s

source: Skipping %s
pl: Pominięto %s

source: Quitting converting work.
pl: Zakończenie konwersji.

source: No files selected.
pl: Nie wybrano żadnych plików.

source: Starting a job for file: %s
pl: Rozpoczynanie pracy dla pliku: %s

source: File '%s' doesn't exist. Skipping...
pl: Plik '%s' nie istnieje. Pomijanie...

source: Unhandled Subconvert exception occured:
pl: Nastąpił nieobsłużony wyjątek Subconverta:

source: File properties for %s:
pl: Właściwości pliku dla %s:

source: Input encoding : %s
pl: Kodowanie wejściowe : %s

source: Output encoding : %s
pl: Kodowanie wyjściowe : %s

source: Output format : %s
pl: Format wyjściowy : %s

source: Incorrect encoding: '%s'
pl: Niepoprawne kodowanie: '%s'

source: Sync: time spec cannot be empty
pl: Synch.: format czasu nie może być pusty

source: Sync: non-unique time units in time spec
pl: Synch.: jednostki czasu w formacie powtarzają się

source: Sync: some characters not parsed
pl: Synch.: niektóre znaki nie zostały sparsowane

source: Sync: incorrect time spec units
pl: Synch.: niepoprawne jednostki w formacie czasu

source: Sync: offset must be relative. Did you forget a +/- sign?
pl: Synch.: przesunięcie musi być względne. Czy brakuje znaku +/-?

source: Sync: expected subtitle number
pl: Synch.: brak numeru porządkowego napisu

source: Sync: expected time spec
pl: Synch.: brak formatu czasu

source: Sync: incorrect subtitle number: %s
pl: Synch.: niepoprawny numer porządkowy napisu: %s

source: Sync: incorrect offset. Resulting subtitle time would be lower than 0
pl: Synch.: niepoprawne przesunięcie. Wynikowy czas napisu byłby ujemny

source: Sync: expected sync request
pl: Synch.: spodziewano się żądania synchronizacji

source: Sync: incorrect subtitle number: %d
pl: Synch.: niepoprawny numer porządkowy napisu: %d

source: Sync: incorrect time spec. Resulting subtitle time would be lower than 0
pl: Synch.: niepoprawny format czasu. Wynikowy czas napisu byłby ujemny

source: An error occured when trying to open a file:
pl: Przy otwieraniu pliku wystąpił błąd:

source: File encoding:
pl: Kodowanie pliku:

source: Change file encoding
pl: Zmiana kodowania pliku

source: Subtitle format:
pl: Format napisów:

source: <h2>Subconvert</h2> <p> Version: $version<br/> Website: <a href="$website">$website</a><br/> License: $license </p> <h3>Authors</h3> <p> Development: $author<br/> Logo: $author<br/> Icons: <a href="$icon_website">$icon_author</a><br/> Translations: $translators </p> <h3>About</h3> <p>This is Subconvert - movie subtitles editor and converter.</p> <p>If you'd like to help at developing Subconvert, see program <a href="$website">website</a> or contact author.</p>
pl: <h2>Subconvert</h2> <p> Wersja: $version<br/> Strona internetowa: <a href="$website">$website</a><br/> Licencja: $license </p> <h3>Autorzy</h3> <p> Programowanie: $author<br/> Logo: $author<br/> Ikony: <a href="$icon_website">$icon_author</a><br/> Tłumaczenia: $translators </p> <h3>O programie</h3> <p>Oto Subconvert - edytor i konwerter napisów do filmów.</p> <p>Jeśli chcesz pomóc przy rozwoju programu, zajrzyj na <a href="$website">stronę Subconverta</a> lub skontaktuj się z autorem.</p>

source: Theme search paths: %s
pl: Ścieżki szukania motywów: %s

source: Used theme name: '%s'
pl: Używany motyw: '%s'

source: &Open
pl: &Otwórz

source: Open subtitle file.
pl: Otwiera plik napisów.

source: &Save
pl: &Zapisz

source: Save current file.
pl: Zapisuje bieżący plik.

source: S&ave as...
pl: Z&apisz jako...

source: Save current file as...
pl: Zapisuje bieżący plik jako...

source: Sa&ve all
pl: Zapi&sz wszystko

source: Save all opened files.
pl: Zapisuje wszystkie otwarte pliki

source: &Exit
pl: &Wyjście

source: Exit Subconvert.
pl: Zakańcza Subconverta

source: &Undo
pl: &Cofnij

source: &Redo
pl: &Powtórz

source: &Link video
pl: P&rzypisz wideo

source: U&nlink video
pl: U&suń przypisanie wideo

source: &Get FPS
pl: Pobierz &FPS

source: &Insert subtitle
pl: &Wstaw napis

source: &Add subtitle
pl: &Dodaj napis

source: &Offset
pl: Pr&zesunięcie

source: &Remove subtitles
pl: &Usuń napis

source: &Find...
pl: Szuk&aj...

source: &Play/pause
pl: &Odtwórz/wstrzymaj

source: Toggle video playback
pl: Przełącza odtwarzanie pliku wideo

source: &Forward
pl: &Do przodu

source: &Rewind
pl: &Cofnij

source: Next &frame
pl: &Następna ramka

source: Go to the next frame in a video
pl: Przechodzi do następnej ramki w pliku wideo

source: Previous f&rame
pl: &Poprzednia ramka

source: Go to the previous frame in a video
pl: Przechodzi do poprzedniej ramki w pliku wideo

source: &Jump to subtitle
pl: &Skocz do napisu

source: Subtitle &Properties Editor
pl: Edytor &Właściwości Napisów

source: &Video player
pl: Odtwarzacz &wideo

source: Show or hide video player
pl: Pokazuje lub ukrywa panel wideo

source: Side &panel
pl: &Panel boczny

source: Show or hide left panel
pl: Pokazuje lub ukrywa lewy panel

source: &Help
pl: &Pomoc

source: Open &help page
pl: Otwiera stronę pomocy

source: &About Subconvert
pl: &O programie Subconvert

source: &File
pl: &Plik

source: &Subtitles
pl: Napi&sy

source: &Frames per second
pl: &Klatki na sekundę

source: Subtitles forma&t
pl: Forma&t napisów

source: Input &encoding
pl: Kodowanie w&ejściowe

source: &Output encoding
pl: Kodowanie w&yjściowe

source: &Video
pl: Wi&deo

source: &Playback
pl: O&dtwarzanie

source: Vie&w
pl: &Widok

source: &Tools
pl: &Narzędzia

source: Default
pl: Domyślne

source: Open file
pl: Otwórz plik

source: Subtitles (%s);;All files (*)
pl: Napisy (%s);;Wszystkie pliki (*)

source: Couldn't save file
pl: Nie udało się zapisać pliku

source: Save as...
pl: Zapisz jako...

source: Overwritten by %s
pl: Nadpisane przez %s

source: Error on saving a file
pl: Błąd przy zapisywaniu pliku

source: Following error occured when trying to save a file:
pl: Przy zapisywaniu pliku wystąpił błąd:

source: About Subconvert
pl: O programie Subconvert

source: Couldn't open URL
pl: Nie udało się otworzyć adresu internetowego

source: Failed to open URL: <a href="%(url)s">%(url)s</a>.
pl: Nie udało się otworzyć adresu internetowego: <a href="%(url)s">%(url)s</a>.

source: Select a video
pl: Wybór pliku wideo

source: Video files (%s);;All files (*)
pl: Pliki wideo (%s);;Wszystkie pliki (*)

source: Offset:
pl: &Przesunięcie

source: Offset
pl: Przesunięcie

source: Subtitle Properties Editor
pl: Edytor Właściwości Napisów

source: FPS
pl: Klatki na sekundę

source: Auto FPS
pl: Pobieraj automatycznie

source: File Encoding
pl: Kodowanie pliku

source: Auto input encoding
pl: Automatyczne kodowanie wejściowe

source: Input encoding
pl: Kodowanie wejściowe

source: Change encoding on save
pl: Zmieniaj kodowanie pliku przy zapisie

source: Output encoding
pl: Kodowanie wyjściowe

source: Subtitle format
pl: Format napisów

source: Output format
pl: Format wyjściowy

source: Open
pl: Otwórz

source: Save
pl: Zapisz

source: Close
pl: Zamknij

source: Subtitle format (%s) doesn't match any of known formats!
pl: Nieznany format napisów (%s)!

source: Incorrect value
pl: Niepoprawna wartość

source: Could not save SPF file because of incorrect parameters.
pl: Nie udało się zapisać pliku SPF z powodu błędnych parametrów.

source: Save Subtitle Properties
pl: Zapisz właściwości napisów

source: Open Subtitle Properties
pl: Otwórz plik właściwości napisów

source: Subtitle Properties (*.spf);;All files (*)
pl: Pliki Własciwości (*spf);;Wszystkie pliki (*)

source: Subtitle change (%d: %s)
pl: Zmiana napisu (%d: %s)

source: Subtitle data change
pl: Zmiana danych napisu

source: New file: %s
pl: Nowy plik: %s

source: New file (copy): %s
pl: Nowy plik (kopia): %s

source: Removal of file: %s
pl: Usunięcie pliku: %s

source: New subtitle (%d)
pl: Nowy napis (%d)

source: Subtitle removal
pl: Usunięcie napisu

source: Subtitle removal (%(sub)s)
pl: Usunięcie napisu (%(sub)s)

source: File name
pl: Nazwa pliku

source: &Open in tab
pl: &Otwórz na karcie

source: Use Subtitle &Properties
pl: Użyj &właściwości napisów

source: &Show subtitles
pl: &Wyświetl napisy

source: &Close subtitles
pl: &Zamknij napisy

source: Property file: %s
pl: Plik właściwości: %s

source: Cannot read %s as Subtitle Property file.
pl: Błąd przy odczytywaniu %s jako pliku Właściwości Napisów.

source: Video path: %s
pl: Ścieżka do wideo: %s

source: No FPS for '%s' (empty subtitles).
pl: Brak wartości klatek na sekundę dla '%s' (puste napisy).

source: Offset by: %s
pl: Przesunięcie o: %s

source: Detected FPS: %s
pl: Wykryte FPS: %s

source: Cannot decode subtitles to '%s' encoding.
pl: Błąd przy dekodowaniu napisów do '%s'.

source: Input encoding: %s
pl: Kodowanie wejściowe : %s

source: Output encoding: %s
pl: Kodowanie wyjściowe : %s

source: Begin
pl: Początek

source: End
pl: Koniec

source: Subtitle
pl: Tekst

source: Decoding error
pl: Błąd dekodowania

source: Cannot decode subtitles to '%s' encoding. Please try different encoding.
pl: Błąd przy dekodowaniu napisów do '%s'. Proszę spróbować innego kodowania

source: Unknown encoding
pl: Nieznane kodowanie

source: Unknown encoding: '%s'
pl: Nieznane kodowanie: '%s'

source: Subtitles
pl: Napisy

source: SubtitleEditor not created for %s!
pl: Edytor napisów nie utworzony dla %s!

source: No subtitle data
pl: Brak napisów

source: Open subtitles in a new tab to see their details.
pl: Aby zobaczyć szczegóły napisów, należy je otworzyć w nowej zakładce.

source: mpv cannot be imported. Video player disabled.
pl: Moduł mpv nie mógł być zaimportowany. Odtwarzacz został wyłączony.

source: Play/Pause
pl: Odtwórz/wstrzymaj

source: No video
pl: Brak wideo

source: File name:
pl: Nazwa pliku:

source: Video:
pl: Wideo:

source: Input encoding:
pl: Kodowanie wejściowe:

source: Output encoding:
pl: Kodowanie wyjściowe:

source: Details
pl: Szczegóły

source: History of changes
pl: Historia zmian

source: <Original file>
pl: <Oryginalny plik>

source: Synchronize
pl: Synchronizacja

source: Subtitles synchronization
pl: Synchronizacja napisów

source: Select a subtitle and position in current video first.
pl: Najpierw należy wybrać odpowiedni napis i pozycję w bieżącym pliku wideo.

source: Can't repeat synchronization points
pl: Punkty synchronizacji nie mogą się powtarzać

source: Subtitle and video have different framerates (%(sub)s vs%(vid)s
pl: Napisy i wideo mają różne prędkości (%(sub)s i %(vid)s

source: No.
pl: Poz.

source: New begin
pl: Nowy początek

source: New end
pl: Nowy koniec

source: Add new synchronization point
pl: Dodaj nowy punkt synchronizacji

source: Apply
pl: Zastosuj

source: Not a known subtitle format
pl: Nieznany format napisów

source: Parsing error
pl: Błąd parsowania

source: Negative time present.
pl: Wykryto ujemną wartość czasu.

source: FPS values are not equal
pl: Wartości FPS nie są równe

source: Syncing times for sync points:
pl: Synchronizacja według punktów:

source: Currently synced subtitle has lower time than a previous one:%s < %s
pl: Czas bieżącego napisu jest niższy od wcześniejszego: %s < %s

source: Unknown format: %s
pl: Nieznany format: '%s'

source: Detecting encoding from %d byte
pl: Wykrywanie kodowania z %d. bajtu

source: ...detected %s encoding.
pl: ...wykryto kodowanie %s

source: I am not too confident about encoding (most probably %(enc)s). Returning default %(def)s
pl: Nie jestem pewien co do kodowania (prawdopodobnie %(enc)s). Zwracanie domyślnego %(def)s

source: Unknown encoding name: '%s'.
pl: Nieznana nazwa kodowania: '%s'.

source: Cannot handle '%(file)s' with '%(enc)s' encoding.
pl: Nie można otworzyć pliku '%(file)s' przy użyciu kodowania '%(enc)s'.

source: Real file path to write: %s
pl: Pełna ścieżka pliku do zapisu: %s

source: There are some characters in '%(file)s' that cannot be encoded to '%(enc)s'.
pl: W pliku '%(file)s' są znaki, które nie mogą zostać zakodowane przy użyciu '%(enc)s'.

source: File already exists: %s
pl: Plik istnieje: %s

source: '%s' exists and needs to be removed before backing up.
pl: Plik '%s' istnieje i musi zostać usunięty przed wykonaniem kopii zapasowej.

source: Got %(fps)s FPS from '%(movie)s'.
pl: Otrzymano %(fps)s. klatkę na sekundę z '%(movie)s'.

source: libmediainfo is not available. Subconvert will not analyze videos.
pl: Biblioteka libmediainfo jest niedostępna. Subconvert nie będzie analizował plików wideo.
