Repository: pypi-data/pypi-mirror-24
Catalog: packages/django-formidable/django-formidable-0.14.0.tar.gz/django-formidable-0.14.0/formidable/locale/*/LC_MESSAGES/django.po
Languages: fr

source: You need to specify {attr} in {name}
fr: Vous devez spécifier {attr} pour {name}

source: Empty value not accepted for {attr} in {name}
fr: Valeur vide refusée pour {attr} dans {name}

source: Missing presets arguments : {}
fr: Paramètre(s) de règle manquant(s) : {}

source: Extra presets arguments : {}
fr: Arguments additionnels du paramétrage : {}

source: Bad field references in presets : {}
fr: Mauvais paramétrage de champ dans la règle : {}

source: Ensure both fields are identical
fr: Assurez-vous que les deux champs sont de même type

source: {left} is not equal to {right}
fr: {left} est différent de {right}

source: Reference
fr: Référence

source: field to compare
fr: champ à comparer

source: Compare to
fr: Comparer à

source: compare with
fr: comparer à

source: Comparison
fr: Comparaison

source: Compare two fields with standard operation
fr: Comparer deux champs en sélectionnant un opérateur

source: {left} is not {operator} to {right}
fr: {left} n'est pas {operator} {right}

source: Operator
fr: Opérateur

source: Ensure this field is greater than %(limit_value)s
fr: Vérifiez que ce champ est supérieur à %(limit_value)s

source: Ensure this field is less than %(limit_value)s
fr: Vérifiez que ce champ est inférieur à %(limit_value)s

source: Ensure this field is equal to %(limit_value)s
fr: Vérifiez que ce champ est égal à %(limit_value)s

source: Ensure this field is not equal to %(limit_value)s
fr: Vérifiez que ce champ est différent de %(limit_value)s
