Repository: pypi-data/pypi-mirror-24
Catalog: packages/plone.app.dexterity/plone.app.dexterity-2.0.19.tar.gz/plone.app.dexterity-2.0.19/plone/app/dexterity/locales/*/LC_MESSAGES/plone.app.dexterity.po
Languages: nl

source: # of items
nl: aantal items

source: Add Content Type
nl: Voeg contenttype toe

source: Add New Content Type…
nl: Voeg contenttype toe

source: Adds Dexterity-based Folder and Document types for testing.
nl: Voegt Dexterity-gebaseeerde Map en Pagina-types toe voor testdoeleinden.

source: Adds Dublin Core metadata fields (equals Basic metadata + Categorization + Effective range + Ownership)
nl: Voegt standaardvelden voor metadata toe (combinatie van Basis metadata + Categorisatie + Publicatieperiode + Auteurinformatie)

source: Adds a title and description
nl: Voegt velden toe voor titel en omschrijving.

source: Adds creator, contributor, and rights fields
nl: Voegt velden toe voor auteur, mede-auteur en rechthebbende.

source: Adds creator, contributor, and rights fields.
nl: Voegt velden toe voor auteur, mede-auteur en rechthebbende.

source: Adds effective date and expiration date fields.
nl: Voeg velden toe voor ingangs- en verloopdatum

source: Adds keywords and language fields.
nl: Voegt velden toe voor trefwoorden en taal.

source: Adds keywords and language setting
nl: Voegt velden toe voor trefwoorden en taal.

source: Adds standard metadata fields (equals Basic metadata + Categorization + Effective range + Ownership)
nl: Voegt standaardvelden voor metadata toe (combinatie van Basis metadata + Categorisatie + Publicatieperiode + Auteurinformatie)

source: Adds title and description fields.
nl: Voegt velden toe voor titel en omschrijving.

source: Allow discussion
nl: Reacties toestaan

source: Allow discussion for this content object.
nl: Reacties toestaan voor dit item.

source: Allow discussion on this item
nl: Reacties toestaan voor dit item.

source: Allow items to be excluded from navigation
nl: Voegt de functie toe om items uit te sluiten van navigatie

source: Allow items to have next previous navigation enabled
nl: voegt de functie toe om vorige/volgende navigatie in te schakelen

source: Allowed Content Types
nl: Toegestane contenttypes

source: Assign an effective and/or expiration date
nl: Voeg velden toe voor ingangs- en verloopdatum

source: Automatically generate short URL name for content based on its initial title
nl: Genereer de verkorte naam voor dit item automatisch op basis van de titel (alleen bij het aanmaken)

source: Automatically generate short URL name for content based on its primary field file name
nl: Genereer de verkorte naam voor dit item automatisch op basis van de bestandnaam (alleen bij het aanmaken)

source: Basic metadata
nl: Algemene metadata

source: Behaviors
nl: Uitbreidingen

source: Behaviors successfully updated.
nl: Uitbreidingen zijn bijgewerkt

source: Categorization
nl: Categorisatie

source: Clone
nl: Klonen

source: Clone Content Type
nl: Kloon Contenttype

source: Configures various components needed for full Dexterity support.
nl: Stelt diverse onderdelen in voor volledige Dexterity-ondersteuning.

source: Date range
nl: Datumreeks

source: Description
nl: Beschrijving

source: Effective range
nl: Publicatieperiode

source: Enable next previous navigation for all items of this type
nl: Activeer vorige/volgende navigatie voor alle items van dit contenttype

source: Error: all model elements must be 'schema'
nl: Fout: alle model-elementen moeten 'schema' zijn

source: Error: root tag must be 'model'
nl: Fout: root element moet 'model' zijn

source: Exclude From navigation
nl: Sluit uit van de navigatiestructuur

source: Export Schema Models
nl: Exporteer schema-modellen

source: Export Type Profiles
nl: Exporteer contenttype-profielen

source: Fields
nl: Velden

source: Filter Contained Types
nl: Filter ingesloten contenttypes

source: Folder Addable Constrains
nl: Beperkingen voor toevoegen aan map

source: Items of this type will be able to contain other items.
nl: Items van dit contenttype kunnen andere items bevatten.

source: Make all items of this type a navigation root
nl: Maak alle items van dit type een nieuwe navigatie root

source: Name from file name
nl: Naam van bestandsnaam

source: Name from title
nl: Naam van titel

source: Navigation root
nl: Navigatie hoofdmap

source: Next previous navigation
nl: Vorige/volgende navigatie

source: Next previous navigation toggle
nl: vorige/volgende navigatie-instelling

source: No
nl: Nee

source: No changes were made.
nl: Er werden geen wijzigingen gedaan.

source: Overview
nl: Overzicht

source: Ownership
nl: Eigenaar

source: Please select a single type to clone.
nl: Kies één contenttype om te klonen.

source: Please select a type to clone.
nl: Kies een contenttype om te klonen.

source: Please select types to export.
nl: Kies contenttypes om te exporteren.

source: Please use only letters, numbers, and the following characters: .-_
nl: Gebruik alleen cijfers, letters en de volgende karakters: .-_

source: Restrict the content types that can be added to folderish content
nl: Beperk de contenttypes die men kan toevoegen aan items met mapfunctionaliteit

source: Saved
nl: Opgeslagen

source: Select the behaviors to enable for this content type.
nl: Selecteer de extra funcie

source: Settings
nl: Instellingen

source: Short Name
nl: Verkorte naam

source: The following custom content types are available for your site.
nl: De volgende maatwerk contenttypes zijn beschikbaar voor uw website.

source: There is already a content type named '${name}'
nl: Er bestaat al een item met de naam ${name} in deze map.

source: Type Name
nl: Naam type

source: Type added successfully.
nl: Type is toegevoegd

source: Type cloned successfully.
nl: Type is gekloond

source: Used for programmatic access to the type.
nl: Wordt gebruikt voor programmatoegang tot het type

source: Yes
nl: Ja

source: help_addcontenttype_button
nl: Contenttypes zijn te selecteren in het 'inhoud toevoegen'-menu, hiermee kunt u eigen (maatwerk)gegevens opslaan in de website. Klik op de "Voeg contenttype toe" knop om een nieuw contenttype te maken.

source: help_exclude_from_nav
nl: Indien geselecteerd, wordt het item niet getoond in de navigatiestructuur

source: help_nextprevious
nl: Dit activeert vorige/volgende navigatie op items die zich in deze map bevinden.

source: label_all_content_types
nl: Alle contenttypes

source: label_contained_items
nl: Ingesloten items

source: label_exclude_from_nav
nl: Sluit uit van navigatie

source: label_filter_contained_types
nl: Items van dit types zijn ook een map kunnen andere items bevatten. Welke andere contenttypes zijn in dit contenttype toegestaan

source: label_nextprevious
nl: Activeer vorige/volgende navigatie

source: label_no_content_types
nl: Geen contenttypes

source: label_some_content_types
nl: Bepaalde contenttypes
